grevaillot/svd_tools/headers/STM32G07x/tim1.h
#define TIM1_CCR1_CCR1_SHIFT		0
#define TIM1_CCR1_CCR1_MASK		0xffff
/** @defgroup tim1_ccr1_ccr1 CCR1 Capture/Compare 1 value
@{*/
/**@}*/


/**@}*/

/** @defgroup tim1_ccr2 CCR2 capture/compare register 2
@{*/


#define TIM1_CCR2_CCR2_SHIFT		0
#define TIM1_CCR2_CCR2_MASK		0xffff
/** @defgroup tim1_ccr2_ccr2 CCR2 Capture/Compare 2 value
@{*/
/**@}*/


/**@}*/

/** @defgroup tim1_ccr3 CCR3 capture/compare register 3
@{*/


#define TIM1_CCR3_CCR3_SHIFT		0
#define TIM1_CCR3_CCR3_MASK		0xffff
/** @defgroup tim1_ccr3_ccr3 CCR3 Capture/Compare value
@{*/
/**@}*/


/**@}*/

/** @defgroup tim1_ccr4 CCR4 capture/compare register 4
@{*/


#define TIM1_CCR4_CCR4_SHIFT		0
#define TIM1_CCR4_CCR4_MASK		0xffff
/** @defgroup tim1_ccr4_ccr4 CCR4 Capture/Compare value
@{*/
/**@}*/


/**@}*/

/** @defgroup tim1_bdtr BDTR break and dead-time register
@{*/

/** TIM1_BDTR_BK2ID Break2 bidirectional **/
#define TIM1_BDTR_BK2ID		(1 << 29)
/** TIM1_BDTR_BKBID Break Bidirectional **/
#define TIM1_BDTR_BKBID		(1 << 28)
/** TIM1_BDTR_BK2DSRM Break2 Disarm **/
#define TIM1_BDTR_BK2DSRM		(1 << 27)
/** TIM1_BDTR_BKDSRM Break Disarm **/
#define TIM1_BDTR_BKDSRM		(1 << 26)
/** TIM1_BDTR_BK2P Break 2 polarity **/
#define TIM1_BDTR_BK2P		(1 << 25)
/** TIM1_BDTR_BK2E Break 2 enable **/
#define TIM1_BDTR_BK2E		(1 << 24)

#define TIM1_BDTR_BK2F_SHIFT		20
#define TIM1_BDTR_BK2F_MASK		0x0f
/** @defgroup tim1_bdtr_bk2f BK2F Break 2 filter
@{*/
/**@}*/


#define TIM1_BDTR_BKF_SHIFT		16
#define TIM1_BDTR_BKF_MASK		0x0f
/** @defgroup tim1_bdtr_bkf BKF Break filter
@{*/
/**@}*/

/** TIM1_BDTR_MOE Main output enable **/
#define TIM1_BDTR_MOE		(1 << 15)
/** TIM1_BDTR_AOE Automatic output enable **/
#define TIM1_BDTR_AOE		(1 << 14)
/** TIM1_BDTR_BKP Break polarity **/
#define TIM1_BDTR_BKP		(1 << 13)
/** TIM1_BDTR_BKE Break enable **/
#define TIM1_BDTR_BKE		(1 << 12)
/** TIM1_BDTR_OSSR Off-state selection for Run mode **/
#define TIM1_BDTR_OSSR		(1 << 11)
/** TIM1_BDTR_OSSI Off-state selection for Idle mode **/
#define TIM1_BDTR_OSSI		(1 << 10)

#define TIM1_BDTR_LOCK_SHIFT		8
#define TIM1_BDTR_LOCK_MASK		0x03
/** @defgroup tim1_bdtr_lock LOCK Lock configuration
@{*/
/**@}*/


#define TIM1_BDTR_DTG_SHIFT		0
#define TIM1_BDTR_DTG_MASK		0xff
/** @defgroup tim1_bdtr_dtg DTG Dead-time generator setup
@{*/
/**@}*/


/**@}*/

/** @defgroup tim1_dcr DCR DMA control register
@{*/


#define TIM1_DCR_DBL_SHIFT		8
#define TIM1_DCR_DBL_MASK		0x1f
/** @defgroup tim1_dcr_dbl DBL DMA burst length
@{*/
/**@}*/


#define TIM1_DCR_DBA_SHIFT		0
#define TIM1_DCR_DBA_MASK		0x1f
/** @defgroup tim1_dcr_dba DBA DMA base address
@{*/
/**@}*/


/**@}*/

/** @defgroup tim1_dmar DMAR DMA address for full transfer
@{*/


#define TIM1_DMAR_DMAB_SHIFT		0
#define TIM1_DMAR_DMAB_MASK		0xffff
/** @defgroup tim1_dmar_dmab DMAB DMA register for burst accesses
@{*/
/**@}*/


/**@}*/

/** @defgroup tim1_or1 OR1 option register 1
@{*/

/** TIM1_OR1_OCREF_CLR Ocref_clr source selection **/
#define TIM1_OR1_OCREF_CLR		(1 << 0)

/**@}*/

/** @defgroup tim1_ccmr3_output CCMR3Output capture/compare mode register 2 (output mode)
@{*/

/** TIM1_CCMR3_Output_OC6M_bit3 Output Compare 6 mode bit 3 **/
#define TIM1_CCMR3_Output_OC6M_bit3		(1 << 24)
/** TIM1_CCMR3_Output_OC5M_bit3 Output Compare 5 mode bit 3 **/
#define TIM1_CCMR3_Output_OC5M_bit3		(1 << 16)
/** TIM1_CCMR3_Output_OC6CE Output compare 6 clear enable **/
#define TIM1_CCMR3_Output_OC6CE		(1 << 15)

#define TIM1_CCMR3_Output_OC6M_SHIFT		12
#define TIM1_CCMR3_Output_OC6M_MASK		0x07
/** @defgroup tim1_ccmr3_output_oc6m OC6M Output compare 6 mode
@{*/
/**@}*/

/** TIM1_CCMR3_Output_OC6PE Output compare 6 preload enable **/
#define TIM1_CCMR3_Output_OC6PE		(1 << 11)
/** TIM1_CCMR3_Output_OC6FE Output compare 6 fast enable **/
#define TIM1_CCMR3_Output_OC6FE		(1 << 10)
/** TIM1_CCMR3_Output_OC5CE Output compare 5 clear enable **/
#define TIM1_CCMR3_Output_OC5CE		(1 << 7)

#define TIM1_CCMR3_Output_OC5M_SHIFT		4
#define TIM1_CCMR3_Output_OC5M_MASK		0x07
/** @defgroup tim1_ccmr3_output_oc5m OC5M Output compare 5 mode
@{*/
/**@}*/

/** TIM1_CCMR3_Output_OC5PE Output compare 5 preload enable **/
#define TIM1_CCMR3_Output_OC5PE		(1 << 3)
/** TIM1_CCMR3_Output_OC5FE Output compare 5 fast enable **/
#define TIM1_CCMR3_Output_OC5FE		(1 << 2)

/**@}*/

/** @defgroup tim1_ccr5 CCR5 capture/compare register 4
@{*/

/** TIM1_CCR5_GC5C3 Group Channel 5 and Channel 3 **/
#define TIM1_CCR5_GC5C3		(1 << 31)
/** TIM1_CCR5_GC5C2 Group Channel 5 and Channel 2 **/
#define TIM1_CCR5_GC5C2		(1 << 30)
/** TIM1_CCR5_GC5C1 Group Channel 5 and Channel 1 **/
#define TIM1_CCR5_GC5C1		(1 << 29)

#define TIM1_CCR5_CCR5_SHIFT		0
#define TIM1_CCR5_CCR5_MASK		0xffff
/** @defgroup tim1_ccr5_ccr5 CCR5 Capture/Compare value
@{*/
/**@}*/


/**@}*/

/** @defgroup tim1_ccr6 CCR6 capture/compare register 4
@{*/


#define TIM1_CCR6_CCR6_SHIFT		0
#define TIM1_CCR6_CCR6_MASK		0xffff
/** @defgroup tim1_ccr6_ccr6 CCR6 Capture/Compare value
@{*/
/**@}*/


/**@}*/

/** @defgroup tim1_af1 AF1 DMA address for full transfer
@{*/


#define TIM1_AF1_ETRSEL_SHIFT		14
#define TIM1_AF1_ETRSEL_MASK		0x07
/** @defgroup tim1_af1_etrsel ETRSEL ETR source selection
@{*/
/**@}*/

/** TIM1_AF1_BKCMP2P BRK COMP2 input polarity **/
#define TIM1_AF1_BKCMP2P		(1 << 11)
/** TIM1_AF1_BKCMP1P BRK COMP1 input polarity **/
#define TIM1_AF1_BKCMP1P		(1 << 10)
/** TIM1_AF1_BKINP BRK BKIN input polarity **/
#define TIM1_AF1_BKINP		(1 << 9)
/** TIM1_AF1_BKCMP2E BRK COMP2 enable **/
#define TIM1_AF1_BKCMP2E		(1 << 2)
/** TIM1_AF1_BKCMP1E BRK COMP1 enable **/
#define TIM1_AF1_BKCMP1E		(1 << 1)
/** TIM1_AF1_BKINE BRK BKIN input enable **/
#define TIM1_AF1_BKINE		(1 << 0)

/**@}*/

/** @defgroup tim1_af2 AF2 DMA address for full transfer
@{*/

/** TIM1_AF2_BK2CMP2P BRK2 COMP2 input polarity **/
#define TIM1_AF2_BK2CMP2P		(1 << 11)
/** TIM1_AF2_BK2CMP1P BRK2 COMP1 input polarity **/
#define TIM1_AF2_BK2CMP1P		(1 << 10)
/** TIM1_AF2_BK2INP BRK2 BKIN input polarity **/
#define TIM1_AF2_BK2INP		(1 << 9)
/** TIM1_AF2_BK2DFBK0E BRK2 DFSDM_BREAK0 enable **/
#define TIM1_AF2_BK2DFBK0E		(1 << 8)
/** TIM1_AF2_BK2CMP2E BRK2 COMP2 enable **/
#define TIM1_AF2_BK2CMP2E		(1 << 2)
/** TIM1_AF2_BK2CMP1E BRK2 COMP1 enable **/
#define TIM1_AF2_BK2CMP1E		(1 << 1)
/** TIM1_AF2_BK2INE BRK2 BKIN input enable **/
#define TIM1_AF2_BK2INE		(1 << 0)

/**@}*/
